Revit 2026 API

# IFCOpeningData Properties

---

The IFCOpeningData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsRecess | Trus if it is a recess, false if it is an opening. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OpeningElementId | The opening element id. |

#### Reference

IFCOpeningData Class

Autodesk.Revit.DB.IFC Namespace